In [4]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np
import random

# create a dataframe of random numbers

vals=np.random.randn(21)

In [7]:
vals[random.sample([i for i in range(21)],5)]=np.nan
df=DataFrame(vals.reshape(7,3),columns=["AAA","BBB","CCC"])
df

        AAA       BBB       CCC
0  2.243613       NaN       NaN
1       NaN  0.847407       NaN
2       NaN       NaN       NaN
3  0.307008 -1.690131 -0.493469
4       NaN       NaN       NaN
5       NaN       NaN -1.290702
6 -0.183045       NaN  0.146960

In [10]:
srs=Series([2,3,4,np.nan,np.nan,7,8,9,np.nan])
print(srs)

0    2.0
1    3.0
2    4.0
3    NaN
4    NaN
5    7.0
6    8.0
7    9.0
8    NaN
dtype: float64

In [11]:
np.isnan(df)

     AAA    BBB    CCC
0  False   True   True
1   True  False   True
2   True   True   True
3  False  False  False
4   True   True   True
5   True   True  False
6  False   True  False

In [13]:
df.isnull()

     AAA    BBB    CCC
0  False   True   True
1   True  False   True
2   True   True   True
3  False  False  False
4   True   True   True
5   True   True  False
6  False   True  False

In [14]:
df.notnull() #opposite of null

     AAA    BBB    CCC
0   True  False  False
1  False   True  False
2  False  False  False
3   True   True   True
4  False  False  False
5  False  False   True
6   True  False   True

In [15]:
df.dropna()

        AAA       BBB       CCC
3  0.307008 -1.690131 -0.493469

In [17]:
#filling information
xbar=srs.mean() # ignore default nan
print(xbar)

5.5

In [18]:
print(srs.fillna(0))

0    2.0
1    3.0
2    4.0
3    0.0
4    0.0
5    7.0
6    8.0
7    9.0
8    0.0
dtype: float64

In [19]:
print(xbar)

5.5

In [22]:
print(srs.fillna(xbar))

0    2.0
1    3.0
2    4.0
3    5.5
4    5.5
5    7.0
6    8.0
7    9.0
8    5.5
dtype: float64

In [23]:
print(srs.fillna(xbar).mean())

5.5

In [24]:
# what about the standard deviation?
srs.std()

2.8809720581775866

In [25]:
srs.fillna(xbar).std()

2.277608394786075